modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PSSI</name>
      <baseAddress>0x50050400</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CKPOL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEPOL</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDYPOL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EDM</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DERDYCFG</name>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTEN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTT4B</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTT1B</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVR_RIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVR_IE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVR_MIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVR_ISC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BYTE0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE1</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BYTE3</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HWCFGR</name>
          <addressOffset>0x3f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>VERR</name>
          <addressOffset>0x3f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IPIDR</name>
          <addressOffset>0x3f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SIDR</name>
          <addressOffset>0x3fc</addressOffset>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA</name>
      <baseAddress>0x5005e000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECLVL</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PROCENDIE</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERRIE</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRERRIE</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROCENDF</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERRF</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRERRF</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PROCENDFC</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMERRFC</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRERRFC</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM.0</name>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.1</name>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.2</name>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.3</name>
          <addressOffset>0x40c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.4</name>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.5</name>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.6</name>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.7</name>
          <addressOffset>0x41c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.8</name>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.9</name>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.10</name>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.11</name>
          <addressOffset>0x42c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.12</name>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.13</name>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.14</name>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.15</name>
          <addressOffset>0x43c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.16</name>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.17</name>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.18</name>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.19</name>
          <addressOffset>0x44c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.20</name>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.21</name>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.22</name>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.23</name>
          <addressOffset>0x45c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.24</name>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.25</name>
          <addressOffset>0x464</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.26</name>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.27</name>
          <addressOffset>0x46c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.28</name>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.29</name>
          <addressOffset>0x474</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.30</name>
          <addressOffset>0x478</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.31</name>
          <addressOffset>0x47c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.32</name>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.33</name>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.34</name>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.35</name>
          <addressOffset>0x48c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.36</name>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.37</name>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.38</name>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.39</name>
          <addressOffset>0x49c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.40</name>
          <addressOffset>0x4a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.41</name>
          <addressOffset>0x4a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.42</name>
          <addressOffset>0x4a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.43</name>
          <addressOffset>0x4ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.44</name>
          <addressOffset>0x4b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.45</name>
          <addressOffset>0x4b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.46</name>
          <addressOffset>0x4b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.47</name>
          <addressOffset>0x4bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.48</name>
          <addressOffset>0x4c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.49</name>
          <addressOffset>0x4c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.50</name>
          <addressOffset>0x4c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.51</name>
          <addressOffset>0x4cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.52</name>
          <addressOffset>0x4d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.53</name>
          <addressOffset>0x4d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.54</name>
          <addressOffset>0x4d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.55</name>
          <addressOffset>0x4dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.56</name>
          <addressOffset>0x4e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.57</name>
          <addressOffset>0x4e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.58</name>
          <addressOffset>0x4e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.59</name>
          <addressOffset>0x4ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.60</name>
          <addressOffset>0x4f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.61</name>
          <addressOffset>0x4f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.62</name>
          <addressOffset>0x4f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.63</name>
          <addressOffset>0x4fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.64</name>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.65</name>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.66</name>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.67</name>
          <addressOffset>0x50c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.68</name>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.69</name>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.70</name>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.71</name>
          <addressOffset>0x51c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.72</name>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.73</name>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.74</name>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.75</name>
          <addressOffset>0x52c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.76</name>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.77</name>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.78</name>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.79</name>
          <addressOffset>0x53c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.80</name>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.81</name>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.82</name>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.83</name>
          <addressOffset>0x54c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.84</name>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.85</name>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.86</name>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.87</name>
          <addressOffset>0x55c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.88</name>
          <addressOffset>0x560</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.89</name>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.90</name>
          <addressOffset>0x568</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.91</name>
          <addressOffset>0x56c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.92</name>
          <addressOffset>0x570</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.93</name>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.94</name>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.95</name>
          <addressOffset>0x57c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.96</name>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.97</name>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.98</name>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.99</name>
          <addressOffset>0x58c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.100</name>
          <addressOffset>0x590</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.101</name>
          <addressOffset>0x594</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.102</name>
          <addressOffset>0x598</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.103</name>
          <addressOffset>0x59c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.104</name>
          <addressOffset>0x5a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.105</name>
          <addressOffset>0x5a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.106</name>
          <addressOffset>0x5a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.107</name>
          <addressOffset>0x5ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.108</name>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.109</name>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.110</name>
          <addressOffset>0x5b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.111</name>
          <addressOffset>0x5bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.112</name>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.113</name>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
        </register>
