modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
        <register>
          <name>RAM.114</name>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.115</name>
          <addressOffset>0x5cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.116</name>
          <addressOffset>0x5d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.117</name>
          <addressOffset>0x5d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.118</name>
          <addressOffset>0x5d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.119</name>
          <addressOffset>0x5dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.120</name>
          <addressOffset>0x5e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.121</name>
          <addressOffset>0x5e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.122</name>
          <addressOffset>0x5e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.123</name>
          <addressOffset>0x5ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.124</name>
          <addressOffset>0x5f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.125</name>
          <addressOffset>0x5f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.126</name>
          <addressOffset>0x5f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.127</name>
          <addressOffset>0x5fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.128</name>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.129</name>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.130</name>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.131</name>
          <addressOffset>0x60c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.132</name>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.133</name>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.134</name>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.135</name>
          <addressOffset>0x61c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.136</name>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.137</name>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.138</name>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.139</name>
          <addressOffset>0x62c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.140</name>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.141</name>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.142</name>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.143</name>
          <addressOffset>0x63c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.144</name>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.145</name>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.146</name>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.147</name>
          <addressOffset>0x64c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.148</name>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.149</name>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.150</name>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.151</name>
          <addressOffset>0x65c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.152</name>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.153</name>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.154</name>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.155</name>
          <addressOffset>0x66c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.156</name>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.157</name>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.158</name>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.159</name>
          <addressOffset>0x67c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.160</name>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.161</name>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.162</name>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.163</name>
          <addressOffset>0x68c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.164</name>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.165</name>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.166</name>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.167</name>
          <addressOffset>0x69c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.168</name>
          <addressOffset>0x6a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.169</name>
          <addressOffset>0x6a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.170</name>
          <addressOffset>0x6a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.171</name>
          <addressOffset>0x6ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.172</name>
          <addressOffset>0x6b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.173</name>
          <addressOffset>0x6b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.174</name>
          <addressOffset>0x6b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.175</name>
          <addressOffset>0x6bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.176</name>
          <addressOffset>0x6c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.177</name>
          <addressOffset>0x6c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.178</name>
          <addressOffset>0x6c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.179</name>
          <addressOffset>0x6cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.180</name>
          <addressOffset>0x6d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.181</name>
          <addressOffset>0x6d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.182</name>
          <addressOffset>0x6d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.183</name>
          <addressOffset>0x6dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.184</name>
          <addressOffset>0x6e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.185</name>
          <addressOffset>0x6e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.186</name>
          <addressOffset>0x6e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.187</name>
          <addressOffset>0x6ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.188</name>
          <addressOffset>0x6f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.189</name>
          <addressOffset>0x6f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.190</name>
          <addressOffset>0x6f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.191</name>
          <addressOffset>0x6fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.192</name>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.193</name>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.194</name>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.195</name>
          <addressOffset>0x70c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.196</name>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.197</name>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.198</name>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.199</name>
          <addressOffset>0x71c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.200</name>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.201</name>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.202</name>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.203</name>
          <addressOffset>0x72c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.204</name>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.205</name>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.206</name>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.207</name>
          <addressOffset>0x73c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.208</name>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.209</name>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.210</name>
          <addressOffset>0x748</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.211</name>
          <addressOffset>0x74c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.212</name>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.213</name>
          <addressOffset>0x754</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.214</name>
          <addressOffset>0x758</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.215</name>
          <addressOffset>0x75c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.216</name>
          <addressOffset>0x760</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.217</name>
          <addressOffset>0x764</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.218</name>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.219</name>
          <addressOffset>0x76c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.220</name>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.221</name>
          <addressOffset>0x774</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.222</name>
          <addressOffset>0x778</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.223</name>
          <addressOffset>0x77c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.224</name>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.225</name>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.226</name>
          <addressOffset>0x788</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.227</name>
          <addressOffset>0x78c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.228</name>
          <addressOffset>0x790</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.229</name>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.230</name>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.231</name>
          <addressOffset>0x79c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.232</name>
          <addressOffset>0x7a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.233</name>
          <addressOffset>0x7a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.234</name>
          <addressOffset>0x7a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.235</name>
          <addressOffset>0x7ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.236</name>
          <addressOffset>0x7b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.237</name>
          <addressOffset>0x7b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.238</name>
          <addressOffset>0x7b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.239</name>
          <addressOffset>0x7bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.240</name>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.241</name>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.242</name>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.243</name>
          <addressOffset>0x7cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.244</name>
          <addressOffset>0x7d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.245</name>
          <addressOffset>0x7d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.246</name>
          <addressOffset>0x7d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.247</name>
          <addressOffset>0x7dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.248</name>
          <addressOffset>0x7e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.249</name>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.250</name>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.251</name>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.252</name>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.253</name>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.254</name>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.255</name>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.256</name>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.257</name>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.258</name>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.259</name>
          <addressOffset>0x80c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.260</name>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.261</name>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.262</name>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.263</name>
          <addressOffset>0x81c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.264</name>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.265</name>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.266</name>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.267</name>
          <addressOffset>0x82c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.268</name>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.269</name>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.270</name>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.271</name>
          <addressOffset>0x83c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.272</name>
          <addressOffset>0x840</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.273</name>
          <addressOffset>0x844</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.274</name>
          <addressOffset>0x848</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.275</name>
          <addressOffset>0x84c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.276</name>
          <addressOffset>0x850</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.277</name>
          <addressOffset>0x854</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.278</name>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
        </register>
