modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
        <register>
          <name>RAM.279</name>
          <addressOffset>0x85c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.280</name>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.281</name>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.282</name>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.283</name>
          <addressOffset>0x86c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.284</name>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.285</name>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.286</name>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.287</name>
          <addressOffset>0x87c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.288</name>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.289</name>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.290</name>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.291</name>
          <addressOffset>0x88c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.292</name>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.293</name>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.294</name>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.295</name>
          <addressOffset>0x89c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.296</name>
          <addressOffset>0x8a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.297</name>
          <addressOffset>0x8a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.298</name>
          <addressOffset>0x8a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.299</name>
          <addressOffset>0x8ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.300</name>
          <addressOffset>0x8b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.301</name>
          <addressOffset>0x8b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.302</name>
          <addressOffset>0x8b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.303</name>
          <addressOffset>0x8bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.304</name>
          <addressOffset>0x8c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.305</name>
          <addressOffset>0x8c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.306</name>
          <addressOffset>0x8c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.307</name>
          <addressOffset>0x8cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.308</name>
          <addressOffset>0x8d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.309</name>
          <addressOffset>0x8d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.310</name>
          <addressOffset>0x8d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.311</name>
          <addressOffset>0x8dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.312</name>
          <addressOffset>0x8e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.313</name>
          <addressOffset>0x8e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.314</name>
          <addressOffset>0x8e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.315</name>
          <addressOffset>0x8ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.316</name>
          <addressOffset>0x8f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.317</name>
          <addressOffset>0x8f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.318</name>
          <addressOffset>0x8f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.319</name>
          <addressOffset>0x8fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.320</name>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.321</name>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.322</name>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.323</name>
          <addressOffset>0x90c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.324</name>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.325</name>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.326</name>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.327</name>
          <addressOffset>0x91c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.328</name>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.329</name>
          <addressOffset>0x924</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.330</name>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.331</name>
          <addressOffset>0x92c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.332</name>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.333</name>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.334</name>
          <addressOffset>0x938</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.335</name>
          <addressOffset>0x93c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.336</name>
          <addressOffset>0x940</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.337</name>
          <addressOffset>0x944</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.338</name>
          <addressOffset>0x948</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.339</name>
          <addressOffset>0x94c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.340</name>
          <addressOffset>0x950</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.341</name>
          <addressOffset>0x954</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.342</name>
          <addressOffset>0x958</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.343</name>
          <addressOffset>0x95c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.344</name>
          <addressOffset>0x960</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.345</name>
          <addressOffset>0x964</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.346</name>
          <addressOffset>0x968</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.347</name>
          <addressOffset>0x96c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.348</name>
          <addressOffset>0x970</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.349</name>
          <addressOffset>0x974</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.350</name>
          <addressOffset>0x978</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.351</name>
          <addressOffset>0x97c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.352</name>
          <addressOffset>0x980</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.353</name>
          <addressOffset>0x984</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.354</name>
          <addressOffset>0x988</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.355</name>
          <addressOffset>0x98c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.356</name>
          <addressOffset>0x990</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.357</name>
          <addressOffset>0x994</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.358</name>
          <addressOffset>0x998</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.359</name>
          <addressOffset>0x99c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.360</name>
          <addressOffset>0x9a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.361</name>
          <addressOffset>0x9a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.362</name>
          <addressOffset>0x9a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.363</name>
          <addressOffset>0x9ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.364</name>
          <addressOffset>0x9b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.365</name>
          <addressOffset>0x9b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.366</name>
          <addressOffset>0x9b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.367</name>
          <addressOffset>0x9bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.368</name>
          <addressOffset>0x9c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.369</name>
          <addressOffset>0x9c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.370</name>
          <addressOffset>0x9c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.371</name>
          <addressOffset>0x9cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.372</name>
          <addressOffset>0x9d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.373</name>
          <addressOffset>0x9d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.374</name>
          <addressOffset>0x9d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.375</name>
          <addressOffset>0x9dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.376</name>
          <addressOffset>0x9e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.377</name>
          <addressOffset>0x9e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.378</name>
          <addressOffset>0x9e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.379</name>
          <addressOffset>0x9ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.380</name>
          <addressOffset>0x9f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.381</name>
          <addressOffset>0x9f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.382</name>
          <addressOffset>0x9f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.383</name>
          <addressOffset>0x9fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.384</name>
          <addressOffset>0xa00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.385</name>
          <addressOffset>0xa04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.386</name>
          <addressOffset>0xa08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.387</name>
          <addressOffset>0xa0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.388</name>
          <addressOffset>0xa10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.389</name>
          <addressOffset>0xa14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.390</name>
          <addressOffset>0xa18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.391</name>
          <addressOffset>0xa1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.392</name>
          <addressOffset>0xa20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.393</name>
          <addressOffset>0xa24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.394</name>
          <addressOffset>0xa28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.395</name>
          <addressOffset>0xa2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.396</name>
          <addressOffset>0xa30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.397</name>
          <addressOffset>0xa34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.398</name>
          <addressOffset>0xa38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.399</name>
          <addressOffset>0xa3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.400</name>
          <addressOffset>0xa40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.401</name>
          <addressOffset>0xa44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.402</name>
          <addressOffset>0xa48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.403</name>
          <addressOffset>0xa4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.404</name>
          <addressOffset>0xa50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.405</name>
          <addressOffset>0xa54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.406</name>
          <addressOffset>0xa58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.407</name>
          <addressOffset>0xa5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.408</name>
          <addressOffset>0xa60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.409</name>
          <addressOffset>0xa64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.410</name>
          <addressOffset>0xa68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.411</name>
          <addressOffset>0xa6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.412</name>
          <addressOffset>0xa70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.413</name>
          <addressOffset>0xa74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.414</name>
          <addressOffset>0xa78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.415</name>
          <addressOffset>0xa7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.416</name>
          <addressOffset>0xa80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.417</name>
          <addressOffset>0xa84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.418</name>
          <addressOffset>0xa88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.419</name>
          <addressOffset>0xa8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.420</name>
          <addressOffset>0xa90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.421</name>
          <addressOffset>0xa94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.422</name>
          <addressOffset>0xa98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.423</name>
          <addressOffset>0xa9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.424</name>
          <addressOffset>0xaa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.425</name>
          <addressOffset>0xaa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.426</name>
          <addressOffset>0xaa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.427</name>
          <addressOffset>0xaac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.428</name>
          <addressOffset>0xab0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.429</name>
          <addressOffset>0xab4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.430</name>
          <addressOffset>0xab8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.431</name>
          <addressOffset>0xabc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.432</name>
          <addressOffset>0xac0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.433</name>
          <addressOffset>0xac4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.434</name>
          <addressOffset>0xac8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.435</name>
          <addressOffset>0xacc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.436</name>
          <addressOffset>0xad0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.437</name>
          <addressOffset>0xad4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.438</name>
          <addressOffset>0xad8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.439</name>
          <addressOffset>0xadc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.440</name>
          <addressOffset>0xae0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.441</name>
          <addressOffset>0xae4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.442</name>
          <addressOffset>0xae8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.443</name>
          <addressOffset>0xaec</addressOffset>
          <size>0x20</size>
        </register>
