modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
        <register>
          <name>RAM.444</name>
          <addressOffset>0xaf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.445</name>
          <addressOffset>0xaf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.446</name>
          <addressOffset>0xaf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.447</name>
          <addressOffset>0xafc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.448</name>
          <addressOffset>0xb00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.449</name>
          <addressOffset>0xb04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.450</name>
          <addressOffset>0xb08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.451</name>
          <addressOffset>0xb0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.452</name>
          <addressOffset>0xb10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.453</name>
          <addressOffset>0xb14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.454</name>
          <addressOffset>0xb18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.455</name>
          <addressOffset>0xb1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.456</name>
          <addressOffset>0xb20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.457</name>
          <addressOffset>0xb24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.458</name>
          <addressOffset>0xb28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.459</name>
          <addressOffset>0xb2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.460</name>
          <addressOffset>0xb30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.461</name>
          <addressOffset>0xb34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.462</name>
          <addressOffset>0xb38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.463</name>
          <addressOffset>0xb3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.464</name>
          <addressOffset>0xb40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.465</name>
          <addressOffset>0xb44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.466</name>
          <addressOffset>0xb48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.467</name>
          <addressOffset>0xb4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.468</name>
          <addressOffset>0xb50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.469</name>
          <addressOffset>0xb54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.470</name>
          <addressOffset>0xb58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.471</name>
          <addressOffset>0xb5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.472</name>
          <addressOffset>0xb60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.473</name>
          <addressOffset>0xb64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.474</name>
          <addressOffset>0xb68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.475</name>
          <addressOffset>0xb6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.476</name>
          <addressOffset>0xb70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.477</name>
          <addressOffset>0xb74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.478</name>
          <addressOffset>0xb78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.479</name>
          <addressOffset>0xb7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.480</name>
          <addressOffset>0xb80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.481</name>
          <addressOffset>0xb84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.482</name>
          <addressOffset>0xb88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.483</name>
          <addressOffset>0xb8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.484</name>
          <addressOffset>0xb90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.485</name>
          <addressOffset>0xb94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.486</name>
          <addressOffset>0xb98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.487</name>
          <addressOffset>0xb9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.488</name>
          <addressOffset>0xba0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.489</name>
          <addressOffset>0xba4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.490</name>
          <addressOffset>0xba8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.491</name>
          <addressOffset>0xbac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.492</name>
          <addressOffset>0xbb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.493</name>
          <addressOffset>0xbb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.494</name>
          <addressOffset>0xbb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.495</name>
          <addressOffset>0xbbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.496</name>
          <addressOffset>0xbc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.497</name>
          <addressOffset>0xbc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.498</name>
          <addressOffset>0xbc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.499</name>
          <addressOffset>0xbcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.500</name>
          <addressOffset>0xbd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.501</name>
          <addressOffset>0xbd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.502</name>
          <addressOffset>0xbd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.503</name>
          <addressOffset>0xbdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.504</name>
          <addressOffset>0xbe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.505</name>
          <addressOffset>0xbe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.506</name>
          <addressOffset>0xbe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.507</name>
          <addressOffset>0xbec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.508</name>
          <addressOffset>0xbf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.509</name>
          <addressOffset>0xbf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.510</name>
          <addressOffset>0xbf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.511</name>
          <addressOffset>0xbfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.512</name>
          <addressOffset>0xc00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.513</name>
          <addressOffset>0xc04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.514</name>
          <addressOffset>0xc08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.515</name>
          <addressOffset>0xc0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.516</name>
          <addressOffset>0xc10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.517</name>
          <addressOffset>0xc14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.518</name>
          <addressOffset>0xc18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.519</name>
          <addressOffset>0xc1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.520</name>
          <addressOffset>0xc20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.521</name>
          <addressOffset>0xc24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.522</name>
          <addressOffset>0xc28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.523</name>
          <addressOffset>0xc2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.524</name>
          <addressOffset>0xc30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.525</name>
          <addressOffset>0xc34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.526</name>
          <addressOffset>0xc38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.527</name>
          <addressOffset>0xc3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.528</name>
          <addressOffset>0xc40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.529</name>
          <addressOffset>0xc44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.530</name>
          <addressOffset>0xc48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.531</name>
          <addressOffset>0xc4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.532</name>
          <addressOffset>0xc50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.533</name>
          <addressOffset>0xc54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.534</name>
          <addressOffset>0xc58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.535</name>
          <addressOffset>0xc5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.536</name>
          <addressOffset>0xc60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.537</name>
          <addressOffset>0xc64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.538</name>
          <addressOffset>0xc68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.539</name>
          <addressOffset>0xc6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.540</name>
          <addressOffset>0xc70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.541</name>
          <addressOffset>0xc74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.542</name>
          <addressOffset>0xc78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.543</name>
          <addressOffset>0xc7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.544</name>
          <addressOffset>0xc80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.545</name>
          <addressOffset>0xc84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.546</name>
          <addressOffset>0xc88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.547</name>
          <addressOffset>0xc8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.548</name>
          <addressOffset>0xc90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.549</name>
          <addressOffset>0xc94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.550</name>
          <addressOffset>0xc98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.551</name>
          <addressOffset>0xc9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.552</name>
          <addressOffset>0xca0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.553</name>
          <addressOffset>0xca4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.554</name>
          <addressOffset>0xca8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.555</name>
          <addressOffset>0xcac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.556</name>
          <addressOffset>0xcb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.557</name>
          <addressOffset>0xcb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.558</name>
          <addressOffset>0xcb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.559</name>
          <addressOffset>0xcbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.560</name>
          <addressOffset>0xcc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.561</name>
          <addressOffset>0xcc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.562</name>
          <addressOffset>0xcc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.563</name>
          <addressOffset>0xccc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.564</name>
          <addressOffset>0xcd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.565</name>
          <addressOffset>0xcd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.566</name>
          <addressOffset>0xcd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.567</name>
          <addressOffset>0xcdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.568</name>
          <addressOffset>0xce0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.569</name>
          <addressOffset>0xce4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.570</name>
          <addressOffset>0xce8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.571</name>
          <addressOffset>0xcec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.572</name>
          <addressOffset>0xcf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.573</name>
          <addressOffset>0xcf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.574</name>
          <addressOffset>0xcf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.575</name>
          <addressOffset>0xcfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.576</name>
          <addressOffset>0xd00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.577</name>
          <addressOffset>0xd04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.578</name>
          <addressOffset>0xd08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.579</name>
          <addressOffset>0xd0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.580</name>
          <addressOffset>0xd10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.581</name>
          <addressOffset>0xd14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.582</name>
          <addressOffset>0xd18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.583</name>
          <addressOffset>0xd1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.584</name>
          <addressOffset>0xd20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.585</name>
          <addressOffset>0xd24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.586</name>
          <addressOffset>0xd28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.587</name>
          <addressOffset>0xd2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.588</name>
          <addressOffset>0xd30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.589</name>
          <addressOffset>0xd34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.590</name>
          <addressOffset>0xd38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.591</name>
          <addressOffset>0xd3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.592</name>
          <addressOffset>0xd40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.593</name>
          <addressOffset>0xd44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.594</name>
          <addressOffset>0xd48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.595</name>
          <addressOffset>0xd4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.596</name>
          <addressOffset>0xd50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.597</name>
          <addressOffset>0xd54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.598</name>
          <addressOffset>0xd58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.599</name>
          <addressOffset>0xd5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.600</name>
          <addressOffset>0xd60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.601</name>
          <addressOffset>0xd64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.602</name>
          <addressOffset>0xd68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.603</name>
          <addressOffset>0xd6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.604</name>
          <addressOffset>0xd70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.605</name>
          <addressOffset>0xd74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.606</name>
          <addressOffset>0xd78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.607</name>
          <addressOffset>0xd7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.608</name>
          <addressOffset>0xd80</addressOffset>
          <size>0x20</size>
        </register>
