modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
        <register>
          <name>RAM.609</name>
          <addressOffset>0xd84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.610</name>
          <addressOffset>0xd88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.611</name>
          <addressOffset>0xd8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.612</name>
          <addressOffset>0xd90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.613</name>
          <addressOffset>0xd94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.614</name>
          <addressOffset>0xd98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.615</name>
          <addressOffset>0xd9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.616</name>
          <addressOffset>0xda0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.617</name>
          <addressOffset>0xda4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.618</name>
          <addressOffset>0xda8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.619</name>
          <addressOffset>0xdac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.620</name>
          <addressOffset>0xdb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.621</name>
          <addressOffset>0xdb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.622</name>
          <addressOffset>0xdb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.623</name>
          <addressOffset>0xdbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.624</name>
          <addressOffset>0xdc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.625</name>
          <addressOffset>0xdc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.626</name>
          <addressOffset>0xdc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.627</name>
          <addressOffset>0xdcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.628</name>
          <addressOffset>0xdd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.629</name>
          <addressOffset>0xdd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.630</name>
          <addressOffset>0xdd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.631</name>
          <addressOffset>0xddc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.632</name>
          <addressOffset>0xde0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.633</name>
          <addressOffset>0xde4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.634</name>
          <addressOffset>0xde8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.635</name>
          <addressOffset>0xdec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.636</name>
          <addressOffset>0xdf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.637</name>
          <addressOffset>0xdf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.638</name>
          <addressOffset>0xdf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.639</name>
          <addressOffset>0xdfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.640</name>
          <addressOffset>0xe00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.641</name>
          <addressOffset>0xe04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.642</name>
          <addressOffset>0xe08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.643</name>
          <addressOffset>0xe0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.644</name>
          <addressOffset>0xe10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.645</name>
          <addressOffset>0xe14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.646</name>
          <addressOffset>0xe18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.647</name>
          <addressOffset>0xe1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.648</name>
          <addressOffset>0xe20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.649</name>
          <addressOffset>0xe24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.650</name>
          <addressOffset>0xe28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.651</name>
          <addressOffset>0xe2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.652</name>
          <addressOffset>0xe30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.653</name>
          <addressOffset>0xe34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.654</name>
          <addressOffset>0xe38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.655</name>
          <addressOffset>0xe3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.656</name>
          <addressOffset>0xe40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.657</name>
          <addressOffset>0xe44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.658</name>
          <addressOffset>0xe48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.659</name>
          <addressOffset>0xe4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.660</name>
          <addressOffset>0xe50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.661</name>
          <addressOffset>0xe54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.662</name>
          <addressOffset>0xe58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.663</name>
          <addressOffset>0xe5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.664</name>
          <addressOffset>0xe60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.665</name>
          <addressOffset>0xe64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.666</name>
          <addressOffset>0xe68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.667</name>
          <addressOffset>0xe6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.668</name>
          <addressOffset>0xe70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.669</name>
          <addressOffset>0xe74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.670</name>
          <addressOffset>0xe78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.671</name>
          <addressOffset>0xe7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.672</name>
          <addressOffset>0xe80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.673</name>
          <addressOffset>0xe84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.674</name>
          <addressOffset>0xe88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.675</name>
          <addressOffset>0xe8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.676</name>
          <addressOffset>0xe90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.677</name>
          <addressOffset>0xe94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.678</name>
          <addressOffset>0xe98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.679</name>
          <addressOffset>0xe9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.680</name>
          <addressOffset>0xea0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.681</name>
          <addressOffset>0xea4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.682</name>
          <addressOffset>0xea8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.683</name>
          <addressOffset>0xeac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.684</name>
          <addressOffset>0xeb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.685</name>
          <addressOffset>0xeb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.686</name>
          <addressOffset>0xeb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.687</name>
          <addressOffset>0xebc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.688</name>
          <addressOffset>0xec0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.689</name>
          <addressOffset>0xec4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.690</name>
          <addressOffset>0xec8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.691</name>
          <addressOffset>0xecc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.692</name>
          <addressOffset>0xed0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.693</name>
          <addressOffset>0xed4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.694</name>
          <addressOffset>0xed8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.695</name>
          <addressOffset>0xedc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.696</name>
          <addressOffset>0xee0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.697</name>
          <addressOffset>0xee4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.698</name>
          <addressOffset>0xee8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.699</name>
          <addressOffset>0xeec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.700</name>
          <addressOffset>0xef0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.701</name>
          <addressOffset>0xef4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.702</name>
          <addressOffset>0xef8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.703</name>
          <addressOffset>0xefc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.704</name>
          <addressOffset>0xf00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.705</name>
          <addressOffset>0xf04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.706</name>
          <addressOffset>0xf08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.707</name>
          <addressOffset>0xf0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.708</name>
          <addressOffset>0xf10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.709</name>
          <addressOffset>0xf14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.710</name>
          <addressOffset>0xf18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.711</name>
          <addressOffset>0xf1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.712</name>
          <addressOffset>0xf20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.713</name>
          <addressOffset>0xf24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.714</name>
          <addressOffset>0xf28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.715</name>
          <addressOffset>0xf2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.716</name>
          <addressOffset>0xf30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.717</name>
          <addressOffset>0xf34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.718</name>
          <addressOffset>0xf38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.719</name>
          <addressOffset>0xf3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.720</name>
          <addressOffset>0xf40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.721</name>
          <addressOffset>0xf44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.722</name>
          <addressOffset>0xf48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.723</name>
          <addressOffset>0xf4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.724</name>
          <addressOffset>0xf50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.725</name>
          <addressOffset>0xf54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.726</name>
          <addressOffset>0xf58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.727</name>
          <addressOffset>0xf5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.728</name>
          <addressOffset>0xf60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.729</name>
          <addressOffset>0xf64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.730</name>
          <addressOffset>0xf68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.731</name>
          <addressOffset>0xf6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.732</name>
          <addressOffset>0xf70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.733</name>
          <addressOffset>0xf74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.734</name>
          <addressOffset>0xf78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.735</name>
          <addressOffset>0xf7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.736</name>
          <addressOffset>0xf80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.737</name>
          <addressOffset>0xf84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.738</name>
          <addressOffset>0xf88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.739</name>
          <addressOffset>0xf8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.740</name>
          <addressOffset>0xf90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.741</name>
          <addressOffset>0xf94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.742</name>
          <addressOffset>0xf98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.743</name>
          <addressOffset>0xf9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.744</name>
          <addressOffset>0xfa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.745</name>
          <addressOffset>0xfa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.746</name>
          <addressOffset>0xfa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.747</name>
          <addressOffset>0xfac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.748</name>
          <addressOffset>0xfb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.749</name>
          <addressOffset>0xfb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.750</name>
          <addressOffset>0xfb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.751</name>
          <addressOffset>0xfbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.752</name>
          <addressOffset>0xfc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.753</name>
          <addressOffset>0xfc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.754</name>
          <addressOffset>0xfc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.755</name>
          <addressOffset>0xfcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.756</name>
          <addressOffset>0xfd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.757</name>
          <addressOffset>0xfd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.758</name>
          <addressOffset>0xfd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.759</name>
          <addressOffset>0xfdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.760</name>
          <addressOffset>0xfe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.761</name>
          <addressOffset>0xfe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.762</name>
          <addressOffset>0xfe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.763</name>
          <addressOffset>0xfec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.764</name>
          <addressOffset>0xff0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.765</name>
          <addressOffset>0xff4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.766</name>
          <addressOffset>0xff8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.767</name>
          <addressOffset>0xffc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.768</name>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.769</name>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.770</name>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.771</name>
          <addressOffset>0x100c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.772</name>
          <addressOffset>0x1010</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.773</name>
          <addressOffset>0x1014</addressOffset>
          <size>0x20</size>
        </register>
