modm-ext/archive-stmicro-svd/header_stm32l4q5agi6.svd
        <register>
          <name>RAM.774</name>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.775</name>
          <addressOffset>0x101c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.776</name>
          <addressOffset>0x1020</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.777</name>
          <addressOffset>0x1024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.778</name>
          <addressOffset>0x1028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.779</name>
          <addressOffset>0x102c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.780</name>
          <addressOffset>0x1030</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.781</name>
          <addressOffset>0x1034</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.782</name>
          <addressOffset>0x1038</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.783</name>
          <addressOffset>0x103c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.784</name>
          <addressOffset>0x1040</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.785</name>
          <addressOffset>0x1044</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.786</name>
          <addressOffset>0x1048</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.787</name>
          <addressOffset>0x104c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.788</name>
          <addressOffset>0x1050</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.789</name>
          <addressOffset>0x1054</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.790</name>
          <addressOffset>0x1058</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.791</name>
          <addressOffset>0x105c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.792</name>
          <addressOffset>0x1060</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.793</name>
          <addressOffset>0x1064</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.794</name>
          <addressOffset>0x1068</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.795</name>
          <addressOffset>0x106c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.796</name>
          <addressOffset>0x1070</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.797</name>
          <addressOffset>0x1074</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.798</name>
          <addressOffset>0x1078</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.799</name>
          <addressOffset>0x107c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.800</name>
          <addressOffset>0x1080</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.801</name>
          <addressOffset>0x1084</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.802</name>
          <addressOffset>0x1088</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.803</name>
          <addressOffset>0x108c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.804</name>
          <addressOffset>0x1090</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.805</name>
          <addressOffset>0x1094</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.806</name>
          <addressOffset>0x1098</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.807</name>
          <addressOffset>0x109c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.808</name>
          <addressOffset>0x10a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.809</name>
          <addressOffset>0x10a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.810</name>
          <addressOffset>0x10a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.811</name>
          <addressOffset>0x10ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.812</name>
          <addressOffset>0x10b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.813</name>
          <addressOffset>0x10b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.814</name>
          <addressOffset>0x10b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.815</name>
          <addressOffset>0x10bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.816</name>
          <addressOffset>0x10c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.817</name>
          <addressOffset>0x10c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.818</name>
          <addressOffset>0x10c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.819</name>
          <addressOffset>0x10cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.820</name>
          <addressOffset>0x10d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.821</name>
          <addressOffset>0x10d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.822</name>
          <addressOffset>0x10d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.823</name>
          <addressOffset>0x10dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.824</name>
          <addressOffset>0x10e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.825</name>
          <addressOffset>0x10e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.826</name>
          <addressOffset>0x10e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.827</name>
          <addressOffset>0x10ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.828</name>
          <addressOffset>0x10f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.829</name>
          <addressOffset>0x10f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.830</name>
          <addressOffset>0x10f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.831</name>
          <addressOffset>0x10fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.832</name>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.833</name>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.834</name>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.835</name>
          <addressOffset>0x110c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.836</name>
          <addressOffset>0x1110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.837</name>
          <addressOffset>0x1114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.838</name>
          <addressOffset>0x1118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.839</name>
          <addressOffset>0x111c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.840</name>
          <addressOffset>0x1120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.841</name>
          <addressOffset>0x1124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.842</name>
          <addressOffset>0x1128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.843</name>
          <addressOffset>0x112c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.844</name>
          <addressOffset>0x1130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.845</name>
          <addressOffset>0x1134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.846</name>
          <addressOffset>0x1138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.847</name>
          <addressOffset>0x113c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.848</name>
          <addressOffset>0x1140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.849</name>
          <addressOffset>0x1144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.850</name>
          <addressOffset>0x1148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.851</name>
          <addressOffset>0x114c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.852</name>
          <addressOffset>0x1150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.853</name>
          <addressOffset>0x1154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.854</name>
          <addressOffset>0x1158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.855</name>
          <addressOffset>0x115c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.856</name>
          <addressOffset>0x1160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.857</name>
          <addressOffset>0x1164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.858</name>
          <addressOffset>0x1168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.859</name>
          <addressOffset>0x116c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.860</name>
          <addressOffset>0x1170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.861</name>
          <addressOffset>0x1174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.862</name>
          <addressOffset>0x1178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.863</name>
          <addressOffset>0x117c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.864</name>
          <addressOffset>0x1180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.865</name>
          <addressOffset>0x1184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.866</name>
          <addressOffset>0x1188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.867</name>
          <addressOffset>0x118c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.868</name>
          <addressOffset>0x1190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.869</name>
          <addressOffset>0x1194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.870</name>
          <addressOffset>0x1198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.871</name>
          <addressOffset>0x119c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.872</name>
          <addressOffset>0x11a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.873</name>
          <addressOffset>0x11a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.874</name>
          <addressOffset>0x11a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.875</name>
          <addressOffset>0x11ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.876</name>
          <addressOffset>0x11b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.877</name>
          <addressOffset>0x11b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.878</name>
          <addressOffset>0x11b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.879</name>
          <addressOffset>0x11bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.880</name>
          <addressOffset>0x11c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.881</name>
          <addressOffset>0x11c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.882</name>
          <addressOffset>0x11c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.883</name>
          <addressOffset>0x11cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.884</name>
          <addressOffset>0x11d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.885</name>
          <addressOffset>0x11d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.886</name>
          <addressOffset>0x11d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.887</name>
          <addressOffset>0x11dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.888</name>
          <addressOffset>0x11e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.889</name>
          <addressOffset>0x11e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.890</name>
          <addressOffset>0x11e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.891</name>
          <addressOffset>0x11ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.892</name>
          <addressOffset>0x11f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>RAM.893</name>
          <addressOffset>0x11f4</addressOffset>
          <size>0x20</size>
        </register>
